doc/main.org
#+latex_class: jsarticle
#+latex_class_options: [platex,12pt,a4paper]
#+latex_header:\usepackage[margin=15mm]{geometry}
#+latex_header:\usepackage{rmss_math}
#+latex_header:\usepackage{titlesec}
#+latex_header_extra:\titleformat{\section}{\normalfont\Large\bfseries}{第\thesection{}講　}{0em}{}
#+description:
#+keywords:
#+title:経済数学
#+author: 長江 剛志
#+subtitle: 数理最適化と均衡分析の立場から
#+date: \today
#+options: toc:t tex:t
* イントロダクション
** ラーメン屋と最適化・均衡状態
- 2つのラーメン屋A軒とB亭があるとしよう．A軒はカウンターだけで狭いが，料金が安くボリュームたっぷりで学生に人気がある．
  B亭は広くてテーブル席も多いが，料金の割に丼は小振りでファミリーに人気がある．
- あなたが昼食にラーメンを食べたいと思い，A軒とB亭のどちらにしようかと考え，自分にとって望ましい方を選択することは, **最適化** と呼ばれる．
  - たとえば，A軒とB亭とで，i)ラーメンが出てくるまでにかかる待ち時間; ii)料金; iii)味や量の好み，という3つの要素が次のようになっていたとする:
   |----------+-----------------------+---------------------|
   |          | A軒                   | B亭                 |
   |----------+-----------------------+---------------------|
   | 待ち時間 | 30分                  | 10分                |
   | 料金     | 500円                 | 700円               |
   | 味, 量   | こってり, 350g(大盛り) | あっさり, 200g(普通) |
   |----------+-----------------------+---------------------|
  - これを最適化として取り扱うため，A軒とB亭のそれぞれでラーメンを食べることの「幸せの度合い」を数値化することにしよう．
    数値化された幸せの度合いは, **効用** (utility)と呼ばれる．本来，効用には単位は必要ない
    #+latex: \footnote{
    一般に，経済学では，効用はその大小(順番)にのみ意味があるという考え方をする（序数的効用）．
    つまり，AとBの選択肢があったとき「Aの効用がBの効用より大きい」ことにだけ意味があるのであって，そのことが表現できるならば，
    Aの効用が \(100\) でBの効用が \(90\) であろうと，Aの効用が \(-1000\) でBの効用が \(-1001\)だろうと構わない，
    という立場である．
    これに対して，ここで示したように，効用の数値そのものに意味があるという考え方は，基数的効用と呼ばれる．
    #+latex: }
    のだが，簡単のため，単位を「円」で考えることにする．
  - まず，各ラーメン屋の「味と量」に対する **価値** を考えよう．ここでの価値\(V\)は，
    「そのラーメンになら\(V\)円までなら支払っても良いと思う（支払い意思額）」あるいは
    「そのラーメンが\(V\)円以上だったら食べるのを諦める（留保価格）」とする．
    この値段は，実際のメニュー表に載っている値段とは無関係に，あなたの主観で決まる．
    ものすごくお腹が空いていたらA軒のラーメンに \(1,000\)円の価値を感じるかもしれないし，
    胃がもたれていたらB亭のラーメンに \(750\)円の価値を感じるかもしれない．
    注意したいのは，あなたが実際にお金を払ってでもラーメンを食べたい，というのは，
    そのラーメンに対する価値が，そのラーメンの費用（後述）よりも高いことを意味することだ．
  - 次に，それぞれのラーメン屋の待ち時間も「円」に換算しておこう．1分の価値の考え方には色々あるが，
    例えば，あなたのバイトの時給が900円だったとしたら，あなたにとっての1分は15円の価値を持つ，と考えることができる．
    このとき，A軒の待ち時間30分は450円に，B亭の待ち時間10分は150円に相当する．
  - ここで求めた「待ち時間（を金銭換算したもの）」にラーメンの「料金」を加えたものが，
    それぞれのラーメン屋を選ぶことの **費用** となる．時間価値が1分15円なら，それぞれのラーメン屋の費用は，
    以下のように整理できる：
    |----------+-------------+-------------|
    |          | A軒         | B亭         |
    |----------+-------------+-------------|
    | 待ち時間 | 450円(30分) | 150円(10分) |
    | 料金     | 500円       | 700円       |
    |----------+-------------+-------------|
    | 費用     | 950円       | 850円       |
    |----------+-------------+-------------|
  - あなたにとっての各ラーメン屋の効用は，上記の価値と費用で表される．仮に，A軒とB亭の味・量に対する
    あなたの価値がいずれも $1,000$ 円だった場合，各選択肢の効用は以下のように整理できる：
    |----------------------------+--------+--------|
    |                            | A軒    | B亭    |
    |----------------------------+--------+--------|
    | 味・量に対する価値         | 1000円 | 1000円 |
    | 待ち時間・料金に対する費用 | 950円  | 850円  |
    |----------------------------+--------+--------|
    | 効用                       | 50円   | 150円    |
    |----------------------------+--------+----------|

    経済学の基本的考えでは「合理的な経済主体は，このように各選択肢の効用を評価した上で，
    最も効用が高い選択肢を選択する」と仮定する．

** 
** 
- 経済学というのは，つまるところ **資源の配分** の学問．
- たとえば，レストラン\footnote{もちろん，居酒屋でも良いのだが，未成年の受講生に配慮して．}の経営を考えてみよう．そこでは，限られた数の厨房スタッフが，限られた調理器具や設備を使って，限られた食材・調味料から料理を作り，それを限られた数のホールスタッフがお客さんのテーブルに提供することで，対価としての報酬を得ている．さらに，その報酬（これもまた有限の資源である）を，スタッフの給料や，仕入れや，設備の維持更新などに充足している．これらをデタラメやったらすぐに店がつぶれてしまうから，経営者は何とかやりくりしないといけない．
- あなたがバイト先としてレストランを考えているとしよう．
- あなたが今夜の夕食にどのレストランを選ぶかを考えてみよう．あなたは，お財布の中身（限られた予算）と相談しながら，美味しくて，雰囲気が良くて，スタッフの器量がよいレストランを選ぶだろう．もちろん，夕食に充てられる時間も限られているから，注文した料理がいつまでも出てこないレストランは選ばない．
- 経営者の経済活動：入力（生産要素）として，労働力（厨房スタッフ，ホールスタッフ）や食材を投入し，生産設備（厨房，調理器具)を使って生産した財（料理）を提供する．
- 
* リア充問題から始める線形計画問題
- 時間制約，予算制約，体力制約の下で，充実度（効用）を最大化するようにバイトとデートの時間の配分を決める．
- 定式化：未知変数，制約条件，目的関数．
- 線形計画問題：目的関数が未知変数に対して線形で，制約条件が未知変数に対する線形不等式．
- 幾何学的なイメージとして理解してみる．
- 幾何学的なイメージのまま，感度分析してみる：バイト給料が下った場合，彼女と喧嘩した場合，試験前でリア充時間が減った場合．
- 線形計画問題の例
  - 栄養問題
  - Hitchcock 型輸送問題
  - 割当問題
  - 最小費用流問題/最短経路問題/最大流問題
  - 
 
* 線形計画問題：標準形
- 標準最小化問題．どんな問題でもこの形に直せば，システマティックに分析できるよ．- 標準最小化問題．どんな問題でもこの形に直せば，システマティックに分析できるよ．
* 
