doc/main.tex
% Created 2022-03-07 Mon 18:36
% Intended LaTeX compiler: pdflatex
\documentclass[platex,12pt,a4paper]{jsarticle}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=15mm]{geometry}
\usepackage{rmss_math}
\usepackage{titlesec}
\titleformat{\section}{\normalfont\Large\bfseries}{第\thesection{}講　}{0em}{}
\author{長江 剛志}
\date{\today}
\title{経済数学\\\medskip
\large 数理最適化と均衡分析の立場から}
\begin{document}

\maketitle
\tableofcontents

\section{イントロダクション}
\label{sec:org303a2b8}
\subsection{ラーメン屋と最適化・均衡状態}
\label{sec:org0c472b2}
\begin{itemize}
\item 2つのラーメン屋A軒とB亭があるとしよう．A軒はカウンターだけで狭いが，料金が安くボリュームたっぷりで学生に人気がある．
B亭は広くてテーブル席も多いが，料金の割に丼は小振りでファミリーに人気がある．
\item あなたが昼食にラーメンを食べたいと思い，A軒とB亭のどちらにしようかと考え，自分にとって望ましい方を選択することは, \textbf{\textbf{最適化}} と呼ばれる．
\begin{itemize}
\item たとえば，A軒とB亭とで，i)ラーメンが出てくるまでにかかる待ち時間; ii)料金; iii)味や量の好み，という3つの要素が次のようになっていたとする:
\begin{center}
\begin{tabular}{lll}
\hline
 & A軒 & B亭\\
\hline
待ち時間 & 30分 & 10分\\
料金 & 500円 & 700円\\
味, 量 & こってり, 350g(大盛り) & あっさり, 200g(普通)\\
\hline
\end{tabular}
\end{center}
\item これを最適化として取り扱うため，A軒とB亭のそれぞれでラーメンを食べることの「幸せの度合い」を数値化することにしよう．
数値化された幸せの度合いは, \textbf{\textbf{効用}} (utility)と呼ばれる．本来，効用には単位は必要ない
\footnote{
一般に，経済学では，効用はその大小(順番)にのみ意味があるという考え方をする（序数的効用）．
つまり，AとBの選択肢があったとき「Aの効用がBの効用より大きい」ことにだけ意味があるのであって，そのことが表現できるならば，
Aの効用が \(100\) でBの効用が \(90\) であろうと，Aの効用が \(-1000\) でBの効用が \(-1001\)だろうと構わない，
という立場である．
これに対して，ここで示したように，効用の数値そのものに意味があるという考え方は，基数的効用と呼ばれる．
}
のだが，簡単のため，単位を「円」で考えることにする．
\item まず，各ラーメン屋の「味と量」に対する \textbf{\textbf{価値}} を考えよう．ここでの価値\(V\)は，
「そのラーメンになら\(V\)円までなら支払っても良いと思う（支払い意思額）」あるいは
「そのラーメンが\(V\)円以上だったら食べるのを諦める（留保価格）」とする．
この値段は，実際のメニュー表に載っている値段とは無関係に，あなたの主観で決まる．
ものすごくお腹が空いていたらA軒のラーメンに \(1,000\)円の価値を感じるかもしれないし，
胃がもたれていたらB亭のラーメンに \(750\)円の価値を感じるかもしれない．
注意したいのは，あなたが実際にお金を払ってでもラーメンを食べたい，というのは，
そのラーメンに対する価値が，そのラーメンの費用（後述）よりも高いことを意味することだ．
\item 次に，それぞれのラーメン屋の待ち時間も「円」に換算しておこう．1分の価値の考え方には色々あるが，
例えば，あなたのバイトの時給が900円だったとしたら，あなたにとっての1分は15円の価値を持つ，と考えることができる．
このとき，A軒の待ち時間30分は450円に，B亭の待ち時間10分は150円に相当する．
\item ここで求めた「待ち時間（を金銭換算したもの）」にラーメンの「料金」を加えたものが，
それぞれのラーメン屋を選ぶことの \textbf{\textbf{費用}} となる．時間価値が1分15円なら，それぞれのラーメン屋の費用は，
以下のように整理できる：
\begin{center}
\begin{tabular}{lll}
\hline
 & A軒 & B亭\\
\hline
待ち時間 & 450円(30分) & 150円(10分)\\
料金 & 500円 & 700円\\
\hline
費用 & 950円 & 850円\\
\hline
\end{tabular}
\end{center}
\item あなたにとっての各ラーメン屋の効用は，上記の価値と費用で表される．仮に，A軒とB亭の味・量に対する
あなたの価値がいずれも \(1,000\) 円だった場合，各選択肢の効用は以下のように整理できる：
\begin{center}
\begin{tabular}{lll}
\hline
 & A軒 & B亭\\
\hline
味・量に対する価値 & 1000円 & 1000円\\
待ち時間・料金に対する費用 & 950円 & 850円\\
\hline
効用 & 50円 & 150円\\
\hline
\end{tabular}
\end{center}

経済学の基本的考えでは「合理的な経済主体は，このように各選択肢の効用を評価した上で，
最も効用が高い選択肢を選択する」と仮定する．
\end{itemize}
\end{itemize}

\subsection{}
\label{sec:org774f0fd}
\subsection{}
\label{sec:org42c7f4a}
\begin{itemize}
\item 経済学というのは，つまるところ \textbf{\textbf{資源の配分}} の学問．
\item たとえば，レストラン\footnote{もちろん，居酒屋でも良いのだが，未成年の受講生に配慮して．}の経営を考えてみよう．そこでは，限られた数の厨房スタッフが，限られた調理器具や設備を使って，限られた食材・調味料から料理を作り，それを限られた数のホールスタッフがお客さんのテーブルに提供することで，対価としての報酬を得ている．さらに，その報酬（これもまた有限の資源である）を，スタッフの給料や，仕入れや，設備の維持更新などに充足している．これらをデタラメやったらすぐに店がつぶれてしまうから，経営者は何とかやりくりしないといけない．
\item あなたがバイト先としてレストランを考えているとしよう．
\item あなたが今夜の夕食にどのレストランを選ぶかを考えてみよう．あなたは，お財布の中身（限られた予算）と相談しながら，美味しくて，雰囲気が良くて，スタッフの器量がよいレストランを選ぶだろう．もちろん，夕食に充てられる時間も限られているから，注文した料理がいつまでも出てこないレストランは選ばない．
\item 経営者の経済活動：入力（生産要素）として，労働力（厨房スタッフ，ホールスタッフ）や食材を投入し，生産設備（厨房，調理器具)を使って生産した財（料理）を提供する．
\item 
\end{itemize}
\section{線形計画問題：リア充問題}
\label{sec:orgfc145f6}
\begin{itemize}
\item 時間制約，予算制約，体力制約の下で，充実度（効用）を最大化するようにバイトとデートの時間の配分を決める．
\item 定式化：未知変数，制約条件，目的関数．
\item 線形計画問題：目的関数が未知変数に対して線形で，制約条件が未知変数に対する線形不等式．
\item 幾何学的なイメージとして理解してみる．
\item 幾何学的なイメージのまま，感度分析してみる：バイト給料が下った場合，彼女と喧嘩した場合，試験前でリア充時間が減った場合．
\item 標準最小化問題．どんな問題でもこの形に直せば，システマティックに分析できるよ．
\end{itemize}
\section{}
\label{sec:orgaf585c7}

\section{}
\label{sec:orgeeef415}
\end{document}